adad={
'یک':1,'دو':2,'سه':3,'چهار':4,'پنج':5,'شیش':6,'هفت':7,'هشت':8,'نه':9,'ده':10,
'یازده':11,'دوازده':12,'سیزده':13,'چهارده':14,'پانزده':15,'شانزده':16,'هفده':17,
'هجده':18,'نهصد':19,'بیست':20,'سی':30,'چهل':40,'پنجاه':50,'شصت':60,'هفتصد':70,
'هشتاد':80,'نود':90,'صد':100,'دویست':200,'سیصد':300,'چهارصد':400,'پانصد':500,
'ششصد':600,'هفتصد':700,'هشتصد':800,'نهصد':900}
vahed={'هزار':10**3,'میلیون':10**6,'میلیارد':10**9,
'بیلیون':10**12,'بیلیارد':10**1,'تریلیون':10**18,'تریلیارد':10**21,'کوآدریلیون':10**24,'کادریلیارد':10**27,
'کوینتیلیون':10**30,'کوانتینیارد':10**33,'سکستیلیون':10**36,'سکستیلیارد':10**39,'سپتیلیون':10**42,
'سپتیلیارد':10**45,'اکتیلیون':10**48,'اکتیلیارد':10**51,'نانیلیون':10**54,'نانیلیارد':10**57,'دسیلیون':10**60}
x=input("عدد را وارد کنید...:")
split_number=x.split()
for i in split_number:
    if i == "و":
        del split_number[split_number.index(i)]
number = 0
sum = 0
for i in split_number:
    adad_ = int(adad.get(i, 0))
    vahed_ = int(vahed.get(i, 0))
    if vahed_:  #...یعنی اگر  اون ایندکس آی واحد بود و صفر نبود
        number+= sum*vahed_ #اون عدد را ضرب در واحد میکنه میریزه داخل متغیر اصلی
        sum = 0  # اینجا هم متغیر جمع اعداد رو صفر میکنیم که دوباره برای باثی اعداد محاسبه کنیم 
    elif adad_:
        sum += adad_
number += sum
print(f'{number:,}')
#code by shayan hashemi